{
  "Fractions Forest": {
    "story": "You arrive at the Fractions Forest where a wise Pie Guardian needs help sharing enchanted pies fairly among forest friends.",
    "learning_objectives": [
      "Understand proper and improper fractions",
      "Add and subtract fractions with like denominators",
      "Simplify fraction results"
    ],
    "example_walkthrough": "The Pie Guardian shows two pies cut into fourths. Combining one half and one quarter requires matching denominators before adding."
  },
  "Decimal Desert": {
    "story": "The Decimal Desert's oasis lights only when explorers measure water exactly using decimals.",
    "learning_objectives": [
      "Compare and order decimals",
      "Add and subtract decimals up to thousandths",
      "Convert between fractions and decimals"
    ],
    "example_walkthrough": "An oasis merchant explains that 0.5 liters plus 0.25 liters gives 0.75 liters when lining up decimal points."
  },
  "Geometry Galaxy": {
    "story": "In Geometry Galaxy, you pilot a star cruiser and calculate angles and shapes to chart safe routes between constellations.",
    "learning_objectives": [
      "Classify triangles and quadrilaterals",
      "Calculate perimeter and area of basic shapes",
      "Understand angle sums in polygons"
    ],
    "example_walkthrough": "A navigation droid demonstrates that the interior angles of a triangle always add up to 180 degrees for plotting warp jumps."
  },
  "Measurement Mountain": {
    "story": "Climb Measurement Mountain by packing the right units to survive different climate zones.",
    "learning_objectives": [
      "Convert between metric units",
      "Estimate measurements in real-world contexts",
      "Interpret data from tables and charts"
    ],
    "example_walkthrough": "A mountaineer guide converts 2.5 kilometers to 2,500 meters to map the path to the next camp."
  },
  "Word Problem World": {
    "story": "Word Problem World is filled with storytellers who turn daily adventures into math puzzles.",
    "learning_objectives": [
      "Identify key information in multi-step problems",
      "Model real-life scenarios with equations",
      "Check answers for reasonableness"
    ],
    "example_walkthrough": "A villager describes buying supplies with discounts, guiding you to set up and solve equations to find totals."
  },
  "Ratio Reef": {
    "story": "Dive into Ratio Reef where coral caretakers balance colorful sea gardens using ratios and rates.",
    "learning_objectives": [
      "Interpret ratios and rate language",
      "Solve proportion problems with tables and tape diagrams",
      "Scale recipes and maps using equivalent ratios"
    ],
    "example_walkthrough": "A reef ranger doubles a coral arrangement, showing that 3 red corals to 2 blue corals becomes 6 to 4 when scaled."
  },
  "Algebra Archipelago": {
    "story": "Sail through Algebra Archipelago where island scholars write expressions to decode treasure clues.",
    "learning_objectives": [
      "Translate word phrases into algebraic expressions",
      "Solve one-step and two-step equations",
      "Graph simple relationships on the coordinate plane"
    ],
    "example_walkthrough": "An island elder demonstrates solving 2x + 3 = 11 by undoing operations step by step." 
  },
  "Probability Peaks": {
    "story": "Climb Probability Peaks where avalanche forecasters predict outcomes with data and chance models.",
    "learning_objectives": [
      "Describe probabilities as fractions, decimals, and percents",
      "Create and analyze simple experiments",
      "Use probability to make fair decisions"
    ],
    "example_walkthrough": "A summit scientist rolls a number cube 12 times, comparing experimental results to the expected 1 out of 6 chance."
  },
  "Logic Lagoon": {
    "story": "Logic Lagoon's puzzle guardians guard gates that open only when patterns and arguments are sound.",
    "learning_objectives": [
      "Recognize number and shape patterns",
      "Construct logical arguments using evidence",
      "Critique reasoning for flaws"
    ],
    "example_walkthrough": "A lagoon oracle reveals a pattern that doubles then subtracts one, guiding you to predict the next mosaic tile number."
  }
}
